In [60]:
import pandas as pd

Creating pandas dataframe

1. Using lists

In [61]:
pd.DataFrame([['badam',1000,'brown'],
              ['Kaju',1500,'white'],
              ['Pista',500,'green']],
              index=['a','b','c'],
              columns=['sweet','price','color'])

   sweet  price  color
a  badam   1000  brown
b   Kaju   1500  white
c  Pista    500  green

2. Using Dictionary

In [62]:
pd.DataFrame({'e1':['badam',1000,'brown'],
              'e2':['Kaju',1500,'white'],
              'e3':['Pista',500,'green']},
              index=['a','b','c'])

      e1     e2     e3
a  badam   Kaju  Pista
b   1000   1500    500
c  brown  white  green

Exporting dataframes

In [63]:
data = [['badam',1000,'brown'],
        ['Kaju',1500,'white'],
        ['Pista',500,'green']]

index = ['a','b','c']
columns= ['sweet','price','color']

df = pd.DataFrame(data ,
              index=index,
              columns=columns)
df

   sweet  price  color
a  badam   1000  brown
b   Kaju   1500  white
c  Pista    500  green

In [64]:
df.to_excel("sweets.xlsx")
df.to_json("sweets.json")
df.to_csv("sweets.csv")

Read dataframes from different files

In [65]:
df = pd.read_excel('sweets.xlsx')
df = pd.read_csv('sweets.csv')
df = pd.read_json('sweets.json')

Read dataframe from remote csv

In [66]:
path="https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/refs/heads/master/titanic.csv"
df = pd.read_csv(path)
df.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0

#### Information about the dataframe

In [67]:
df.tail(3)

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
1306,3,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.225,NaN,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.225,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.875,NaN,S,0

In [68]:
len(df)

1309

In [69]:
df.shape

(1309, 11)

In [70]:
df.count()

pclass      1309
name        1309
sex         1309
age         1046
sibsp       1309
parch       1309
ticket      1309
fare        1308
cabin        295
embarked    1307
survived    1309
dtype: int64

In [71]:
df.info()
# Non-null rows, datatypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1046 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1308 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1307 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

Sclicing dataframes

In [72]:
df.head(1)

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,1

In [73]:
df['name'][1]

'Allison, Master. Hudson Trevor'

df.iloc

df.iloc[rows,cols]

In [74]:
df.iloc[0,1]

'Allen, Miss. Elisabeth Walton'

In [75]:
df.iloc[3:15:2, 1:3]

                                                 name     sex
3                Allison, Mr. Hudson Joshua Creighton    male
5                                 Anderson, Mr. Harry    male
7                              Andrews, Mr. Thomas Jr    male
9                             Artagaveytia, Mr. Ramon    male
11  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  female
13                       Barber, Miss. Ellen "Nellie"  female

In [76]:
df.iloc[3:15:2,[3,4,5]]

     age  sibsp  parch
3   30.0      1      2
5   48.0      0      0
7   39.0      0      0
9   71.0      0      0
11  18.0      1      0
13  26.0      0      0

df.loc

df.loc[rows,cols]

In [77]:
df.loc[0:3,['ticket','fare']]

   ticket      fare
0   24160  211.3375
1  113781  151.5500
2  113781  151.5500
3  113781  151.5500

##### df.loc with conditions
##### df.loc[cond_for_rows, cond_for_cols]

In [78]:
df.loc[(df['pclass']==1) & (df['sex']=='male'),::].head(2)

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,1
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.55,C22 C26,S,0

#### Add columns

In [79]:
df['family_members']=df['sibsp']+df['parch']

#### drop columns

In [80]:
df = df.drop(columns=['sibsp','parch'])
df.columns

Index(['pclass', 'name', 'sex', 'age', 'ticket', 'fare', 'cabin', 'embarked',
       'survived', 'family_members'],
      dtype='object')

### rename columns or index

In [81]:
df = df.rename(columns={'sex':'gender'}, index= {1 : "ABC"})

In [82]:
df.head(2)

,pclass,name,gender,age,ticket,fare,cabin,embarked,survived,family_members
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,24160,211.3375,B5,S,1,0
ABC,1,"Allison, Master. Hudson Trevor",male,0.9167,113781,151.5500,C22 C26,S,1,3

#### replace row values

In [83]:
mapping = { 'S':'Southampton' ,
            'C':'Cherbourg' ,
            'Q':'Queenstown' }

df['embarked']=df['embarked'].replace(mapping)

In [84]:
df.head(3)

,pclass,name,gender,age,ticket,fare,cabin,embarked,survived,family_members
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,24160,211.3375,B5,Southampton,1,0
ABC,1,"Allison, Master. Hudson Trevor",male,0.9167,113781,151.5500,C22 C26,Southampton,1,3
2,1,"Allison, Miss. Helen Loraine",female,2.0000,113781,151.5500,C22 C26,Southampton,0,3

#### Creating categorical columns

In [85]:
# 0-2   -> baby
# 2-16  -> child
# 16-25 -> teen
# 25-49 -> adult
# 80+   -> senior

df['age_category'] = pd.cut(df['age'],
                            bins=[0,2,16,25,49,80],
                            labels=['baby','child','teen','adult','senior'])

#### Checking the aggreated values of a column

In [86]:
cond = {'fare':['count','min','max','sum','mean']}
df.agg(cond)

               fare
count   1308.000000
min        0.000000
max      512.329200
sum    43550.486900
mean      33.295479